solokeys/solo1/nrf52840/usb.c
static void power_usb_event_handler(nrf_drv_power_usb_evt_t event)
{
    switch (event)
    {
    case NRF_DRV_POWER_USB_EVT_DETECTED:
        printf("USB power detected\n");
        if (!nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_enable();
        }
        break;
    case NRF_DRV_POWER_USB_EVT_REMOVED:
        printf("USB power removed\n");
        m_usbd_configured = false;
        m_send_mouse_position = false;
        if (nrf_drv_usbd_is_started())
        {
            nrf_drv_usbd_stop();
        }
        if (nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_disable();
        }
        /* Turn OFF LEDs */
        bsp_board_led_off(LED_USB_STATUS);
        bsp_board_led_off(LED_USB_POWER);
        break;
    case NRF_DRV_POWER_USB_EVT_READY:
        printf("USB ready\n");
        bsp_board_led_on(LED_USB_POWER);
        if (!nrf_drv_usbd_is_started())
        {
            nrf_drv_usbd_start(true);
        }
        break;
    default:
        ASSERT(false);
    }
}


void log_resetreason(void)
{
    /* Reset reason */
    uint32_t rr = nrf_power_resetreas_get();
    printf("Reset reasons:\n");
    if (0 == rr)
    {
        printf("- NONE\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_RESETPIN_MASK))
    {
        printf("- RESETPIN\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_DOG_MASK     ))
    {
        printf("- DOG\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_SREQ_MASK    ))
    {
        printf("- SREQ\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_LOCKUP_MASK  ))
    {
        printf("- LOCKUP\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_OFF_MASK     ))
    {
        printf("- OFF\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_LPCOMP_MASK  ))
    {
        printf("- LPCOMP\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_DIF_MASK     ))
    {
        printf("- DIF\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_NFC_MASK     ))
    {
        printf("- NFC\n");
    }
    if (0 != (rr & NRF_POWER_RESETREAS_VBUS_MASK    ))
    {
        printf("- VBUS\n");
    }
}

void usb_init(void)
{
    ret_code_t ret;

    if (NRF_DRV_USBD_ERRATA_ENABLE)
    {
        nrf_drv_usbd_errata_104();
        nrf_drv_usbd_errata_154();
    }


    /* USB work starts right here */
    ret = nrf_drv_usbd_init(usbd_event_handler);
    APP_ERROR_CHECK(ret);

    /* Configure selected size of the packed on EP0 */
    nrf_drv_usbd_ep_max_packet_size_set(NRF_DRV_USBD_EPOUT0, EP0_MAXPACKETSIZE);
    nrf_drv_usbd_ep_max_packet_size_set(NRF_DRV_USBD_EPIN0, EP0_MAXPACKETSIZE);

    /* Configure LED and button */
    /*bsp_board_init(BSP_INIT_LEDS);*/
    /*bsp_board_led_on(LED_RUNNING);*/
    /*bsp_board_led_on(LED_ACTIVE);*/


    if (USBD_POWER_DETECTION)
    {
        /*printf("Using power detection\n");*/
        static const nrf_drv_power_usbevt_config_t config =
        {
            .handler = power_usb_event_handler
        };
        ret = nrf_drv_power_usbevt_init(&config);
        APP_ERROR_CHECK(ret);
    }
    else
    {
        /*printf("No USB power detection enabled\r\nStarting USB now\n");*/
        nrf_delay_us(STARTUP_DELAY*1000);
        if (!nrf_drv_usbd_is_enabled())
        {
            /*printf("enabling\n");*/
            nrf_drv_usbd_enable();
            /*printf("done\n");*/
            ret = ep_configuration(0);
            APP_ERROR_CHECK(ret);
        }
        /* Wait for regulator power up */
        while (NRF_DRV_POWER_USB_STATE_CONNECTED
              ==
              nrf_drv_power_usbstatus_get())
        {
            /* Just waiting */
        }

        if (NRF_DRV_POWER_USB_STATE_READY == nrf_drv_power_usbstatus_get())
        {
            if (!nrf_drv_usbd_is_started())
            {
                nrf_drv_usbd_start(true);
            }
        }
        else
        {
            nrf_drv_usbd_disable();
        }
    }


    /*while (true)*/
    /*{*/
        /*if (m_system_off_req)*/
        /*{*/
            /*printf("Going to system OFF\n");*/
            /*nrf_power_system_off();*/
        /*}*/
        /*if (m_usbd_suspended != m_usbd_suspend_state_req)*/
        /*{*/
            /*if (m_usbd_suspend_state_req)*/
            /*{*/
                /*m_usbd_suspended = nrf_drv_usbd_suspend();*/
                /*if (m_usbd_suspended)*/
                /*{*/
                /*}*/
            /*}*/
            /*else*/
            /*{*/
                /*m_usbd_suspended = false;*/
            /*}*/
        /*}*/

        /*if (m_usbd_configured)*/
        /*{*/
        /*}*/

        /*UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());*/
        /*[>bsp_board_led_off(LED_RUNNING);<]*/
        /* Even if we miss an event enabling USB,
         * USB event would wake us up. */
        /*__WFE();*/
        /*[> Clear SEV flag if CPU was woken up by event <]*/
        /*__SEV();*/
        /*__WFE();*/
        /*bsp_board_led_on(LED_RUNNING);*/
    /*}*/
}
